//Global variable
var descriptions = [
    "Age: อายุของผู้ป่วย (Integer)",
    "Sex: เพศของผู้ป่วย (male, female)",
    "Steroid: การพบสารสเตียรอยด์ (yes, no)",
    "Antivirals: การต้านไวรัส (yes, no)",
    "Fatigue: อาการเหนื่อยล้า (yes, no)",
    "Malaise: อาการวิงเวียนศรีษะ (yes, no)",
    "Anorexia: อาการเบื่ออาหาร (yes, no)",
    "Liver big: ตับขนาดใหญ่กว่าปกติ (yes, no)",
    "Liver firm: ตับแข็ง (yes, no)",
    "Spleen palpable: ความผิดปกติของม้ามที่เห็นได้ชัดเจน (yes, no)",
    "Spiders: มีจุดการขยายของหลอดเลือดแดงเล็กๆ ซึ่งมีจุดแดงตรงกลางและมีแขนงเส้นเลือดกระจายออกไปรอบๆ (yes, no)",
    "Ascites: น้ำขังในช่องท้อง (yes, no)",
    "Varices: หลอดเลือดมีลักษณะโป่งพอง (yes, no)",
    "Bilirubin: สารเคมีชนิดหนึ่งที่ให้สีเหลืองออกน้ำตาล โดยเป็นสารที่เกิดจากการแตกตัวหรือการตายของเซลล์เม็ดเลือดแดงในหลอดเลือด (Real number)",
    "ALK Phosphate: เป็นเอนซัยม์ที่ประกอบด้วยโปรตีนที่ตับสร้างขึ้น ค่าปกติอยู่ระหว่าง 38 – 126 (Integer)",
    "SGOT:เอนซัย์ที่ประกอบด้วยโปรตีนที่ตับสร้างขึ้น มีค่าปกติอยู่ที่ตัวเลขไม่เกิน 40 mg/dl (Integer)",
    "Albumin: โปรตีนชนิดหนึ่งที่ลอยได้ในกระแสเลือดที่ถูกผลิตขึ้นจากตับและมีปริมาณมากกว่าโปรตีนชนิด (Real number)",
    "Prothrombin Time: ย่อมาจาก (Prothrombin Time) การแข็งตัวของเลือด (Integer)",
    "Histology: การมีเนื้อเยื่อร้าย (yes, no)"
]

var valueTest = [[38, "female", "0", "0", "1", "1", "1", "0", "1", "0", "0", "0", "0", "0.6", "76", "18", "4.4", "84", "1", "LIVE"],
[50, "male", "0", "0", "1", "0", "0", "0", "1", "1", "1", "0", "0", "0.9", "230", "117", "3.4", "41", "1", "LIVE"],
[47, "female", "1", "0", "0", "0", "0", "1", "0", "0", "1", "0", "1", "2", "84", "23", "4.2", "66", "1", "DIE"]]
